import numpy as np
from scipy import stats

############################################################
# 样本数据如下：
############################################################
samples = [15.6, 16.2, 22.5, 20.5, 16.4, 19.4, 16.6, 17.9, 12.7, 13.9]
sample_nums = len(samples)

############################################################
# 计算样本的统计量：均值和标准差
############################################################
mean_sample = np.mean(samples)
std_sample = np.std(samples, ddof=1)

############################################################
# 进行假设检验：置信水平α=0.01（第一型错误的发生概率）
############################################################
# 原假设：抽样分布均值=20；备择假设：抽样分布均值＜20
t_value = (mean_sample-20) / (std_sample / (sample_nums**0.5))
degree_of_freedom = sample_nums - 1
# 1-0.01=0.99，查表可得对应的t值为2.821，由t分布的对称性可知对应小于
# 均值一侧的取值为-2.821，上文计算的t_value=-3，小于-2.821，所以拒绝
# 原假设

############################################################
# 假设检验的简单实现
############################################################
res = stats.ttest_1samp(samples, popmean=20, alternative="less")
p = res.pvalue
# p值等于0.0074，小于0.01，所以拒绝原假设
