############################################################
# 已知信息：
############################################################
sample_nums = 100
mean_population = 1.2
mean_sample = 1.05
std_sample = 0.5

############################################################
# 进行假设检验的基本步骤
############################################################
# 1.设置原假设和备择假设，原假设为药物没有影响，抽样分布均值为总体均值1.2
# 2.设置显著性水平α，这里设置为0.05 =============================
# 3.判断抽样分布（样本容量>30认为是正态分布）选择检验统计量，这里是z分数
# 4.根据z分数，查询p值的大小（原假设为真时，样本均值发生的概率）=======
# 5.比较检验统计量p和显著性水平α，如果p<α，则拒绝原假设==============

"""进行实际计算如下"""
# 由于不知道总体的标准差，所以用样本的标准差作为总体标准差的无偏估计====
std_population = 0.5
# 计算抽样分布的标准差 ========================================
std_sample_dis = std_population / (sample_nums**0.5)
# 计算z分数 =================================================
z_score = (mean_population - mean_sample) / std_sample_dis
# 根据z分数，查表获取p值=======================================
p = 0.003
# 结论：p值小于显著性水平α，所以拒绝原假设，可以认为药物对反应时间有影响

# 备择假设是 药物对反应时间有影响，即抽样分布均值mean_sample_dis≠1.2，这时是双侧检验
# 备择假设是 药物减少了反应时间，即抽样分布均值mean_sample_dis＜1.2，这时是单侧检验

# 样本容量>30认为是正态分布，检验统计量是z值
# 样本容量＜30认为是t分布，检验统计量是t值