############################################################
# 样本信息：
############################################################
mean_sample_1 = 9.31
std_sample_1 = 4.67
mean_sample_2 = 7.4
std_sample_2 = 4.04

############################################################
# 求95%的置信水平下的置信区间
############################################################
# 样本均值之差的采样
mean_sample_dif = mean_sample_1 - mean_sample_2
# 根据置信水平计算查询Z表时所需的边界；查表可得Z值为1.96
a_2 = 1 - (1 - 0.95) / 2
z_score = 1.96
# 样本均值之差的标准差采样（作为样本均值之差抽样分布的无偏估计）
mean_sample_dif_std = ((std_sample_1**2)/100 + (std_sample_2**2)/100) ** 0.5
# 置信区间为：
# (mean_sample_dif - 1.96 * mean_sample_dif_std, mean_sample_dif + 1.96 * mean_sample_dif_std)
# (0.7, 3.12)
